Table of Contents
 Enum PrestressSteelType
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Type of prestress steel
public enum PrestressSteelType
Fields
CompactedStrand = 5
Compacted strand - lana
IndentedWire = 1
Indneted wire - draty s vtisky
PlainRoundBar = 3
Plain round bar - hladké tyče
PlainRoundWire = 0
Plain round wire - hladké dráty
RibbedBar = 4
Ribbed bar - žebírkové tyče
Strand = 2
Strand - lana
Fields
 Name |  Description
 CompactedStrand = 5
Compacted strand - lana
 IndentedWire = 1
Indneted wire - draty s vtisky
 PlainRoundBar = 3
Plain round bar - hladké tyče
 PlainRoundWire = 0
Plain round wire - hladké dráty
 RibbedBar = 4
Ribbed bar - žebírkové tyče
 Strand = 2
Strand - lana
 Edit this page